application/cxf-back-jpa/src/test/resources/merchantProductService/associateMerchantProductRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.cxf.example.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ser:associateMerchantWithProduct>
            <!--Optional:-->
            <arg0>
                <!--Optional:-->
                <id>1</id>
                <!--Optional:-->
                <createDate>2021-05-14</createDate>
                <!--Optional:-->
                <name>test</name>
                <!--Optional:-->
                <lastname>test 2</lastname>
                <!--Optional:-->
                <birthdate>1984-09-24</birthdate>
            </arg0>
            <!--Optional:-->
            <arg1>
                <!--Optional:-->
                <id>1</id>
                <!--Optional:-->
                <createDate>2021-05-14</createDate>
                <!--Optional:-->
                <label>test</label>
                <!--Optional:-->
                <weight>12.5</weight>
                <!--Optional:-->
                <height>10.0</height>
                <!--Optional:-->
                <unitPrice>45.99</unitPrice>
            </arg1>
        </ser:associateMerchantWithProduct>
    </soapenv:Body>
</soapenv:Envelope>